app/controllers/tasks_controller.rb

  def index
    @tasks = current_user.tasks
    @to_do = @tasks.where(state: "to_do")
---
SELECT "tasks".* FROM "tasks" WHERE "tasks"."user_id" = $1 AND "tasks"."state" = $2  [["user_id", 1], ["state", "to_do"]]

  def create
    @task = current_user.tasks.new(task_params)

    respond_to do |format|
      if @task.save
---
INSERT INTO "tasks" ("content", "created_at", "updated_at", "user_id", "state") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["content", "hello world"], ["created_at", 2016-08-19 17:35:38 UTC], ["updated_at", 2016-08-19 17:35:38 UTC], ["user_id", 1], ["state", "doing"]]

  def update
    respond_to do |format|
      if @task.update(task_params)
---
UPDATE "tasks" SET "content" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["content", "hello heo"], ["updated_at", 2016-08-19 16:07:43 UTC], ["id", 2]]

  def change
    @task.update_attributes(state: params[:state])
---
UPDATE "tasks" SET "state" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["state", "doing"], ["updated_at", 2016-08-19 18:31:59 UTC], ["id", 3]]